#Створити файл зі списком справ на поточний день: умовна назва, час початку, передбачувана тривалість. Визначити,
#яка справа за списком наступна (найближча до поточного часу). Створити файл з інформацією про вільний час у другій половині
#дня (після 13:00): початок та закінчення тимчасового проміжку та його тривалість (розрахувати)
import funcs
f=input("Enter a name of a file: ")   #ім'я файла
funcs.create_schedule(f)              #створення розкладу, занесення до файлу
act=funcs.read_schedule(f)            #читання з файлу, збереження у змінну розкладу
funcs.next(act)                       #пошук наступної дії
spaces=funcs.spaces(act)              #пошук вільного часу після 13:00
f2=input("Enter a name of a file for spaces: ")   #ім'я файлу для вільного часу
funcs.spaces_file(f2, spaces)         #запис у файл
funcs.print_spaces(f2)                #виведення даних із файлу
